malbanGit/ESP32_P4_Vectrex/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y


#
# SD/MMC Example Configuration
#
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
CONFIG_EXAMPLE_FORMAT_IF_MOUNT_FAILED=n
CONFIG_EXAMPLE_FORMAT_SD_CARD=n
CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_4=y
# CONFIG_EXAMPLE_SDMMC_BUS_WIDTH_1 is not set
CONFIG_EXAMPLE_SDMMC_SPEED_DS=y
# CONFIG_EXAMPLE_SDMMC_SPEED_HS is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_SDR50 is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_DDR50 is not set
# CONFIG_EXAMPLE_SDMMC_SPEED_UHS_I_SDR104 is not set
CONFIG_EXAMPLE_PIN_CARD_POWER_RESET=45
CONFIG_EXAMPLE_PIN_CMD=44
CONFIG_EXAMPLE_PIN_CLK=43
CONFIG_EXAMPLE_PIN_D0=39
CONFIG_EXAMPLE_PIN_D1=40
CONFIG_EXAMPLE_PIN_D2=41
CONFIG_EXAMPLE_PIN_D3=42
# CONFIG_EXAMPLE_DEBUG_PIN_CONNECTIONS is not set
CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_INTERNAL_IO=y
CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_IO_ID=4
# end of SD/MMC Example Configuration
